#### RebarHandleNameData Members

---

|  |
| --- |
| RebarHandleNameData Class   Methods   Properties   See Also |

The  RebarHandleNameData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RebarHandleNameData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetCustomHandleTag | Gets the handle tag for which we need to specify the name. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetCustomHandleName | Sets the name of the handle. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RebarHandleNameData Class

Autodesk.Revit.DB.Structure Namespace